[
          {
            "href": "https://thecl3m.github.io/PortableArcade/",
            "title": "Portable Arcade",
            "imgName": "pabt.jpg",
            "color": "bg-orange-200",
            "description": "My friends and I created a portable arcade machine powered by a Raspberry Pi 4 and equipped with a 7-inch screen. It's designed to support various controllers like a steering wheel, joystick, and a unique glove controller, allowing for a versatile gaming experience. Click on the image for a closer look at our project!"
          },
          {
            "href": "https://mene4485.github.io/theprotocolNFT/index.html",
            "title": "The Protocol NFT",
            "imgName": "prtcl_3.png",
            "color": "bg-orange-200",
            "description": "I developed the landing website for The Protocol NFT, a project leveraging the Ethereum blockchain to enhance direct interactions between NFT holders and their evolving roadmap. Click on the image for a closer look at the site."
          },
          {
            "href": "https://github.com/mene4485/Snake/tree/main",
            "title": "Snake Game in Assembly",
            "imgName": "snake.webp",
            "color": "bg-orange-200",
            "description": "I worked on adapting the classic Snake game to run on the Gecko4Education EPFL-Edition board, using assembly language. This project allowed me to explore the basics of low-level programming and how it interacts with hardware."
          },
          {
            "href": "https://github.com/mene4485/Super-Pac-Man",
            "title": "SuperPac Man",
            "imgName": "pacMan.png",
            "color": "bg-orange-200",
            "description": "In the context of a university project, I worked on developing a pac man implementation in Java."
          },
          {
            "href": "https://github.com/RasanYo/Truster/tree/main",
            "title": "Truster",
            "imgName": "truster_big.png",
            "color": "bg-orange-200",
            "description": "Alongside Rasan, I co-initiated Truster, a service designed to bridge the gap between you and trustworthy locals (Trustees) in your future city. They can inspect apartments for you, offering a safeguard against scams and saving you both time and expenses."
          },
          {
            "href": "https://github.com/mene4485/semanticSegmentation/tree/main",
            "title": "Data Augmentation for Semantic Segmentation",
            "imgName": "DA_SS.jpeg",
            "color": "bg-orange-200",
            "description": "For a university project, I contributed to the development of a data augmentation pipeline, focusing on its impact on the performance of semantic segmentation models."
          }
]
