[
          {
            "href": "https://thecl3m.github.io/PortableArcade/",
            "title": "Portable Arcade",
            "imgName": "pabt.jpg",
            "color": "#D69F7E",            "description": "My friends and I created a portable arcade machine powered by a Raspberry Pi 4 and equipped with a 7-inch screen. It's designed to support various controllers like a steering wheel, joystick, and a unique glove controller, allowing for a versatile gaming experience. Click on the image for a closer look at our project!"
          },
          {
            "href": "https://github.com/RasanYo/Truster/tree/main",
            "title": "Co-founder of Truster",
            "imgName": "truster_big.png",
            "color": "#D69F7E",            "description": "Alongside Rasan, I co-initiated Truster, a service designed to bridge the gap between you and trustworthy locals (Trustees) in your future city. They can inspect apartments for you, offering a safeguard against scams and saving you both time and expenses."
          },
          {
            "href": "https://mene4485.github.io/theprotocolNFT/index.html",
            "title": "The Protocol NFT (Landing Page)",
            "imgName": "prtcl_3.png",
            "color": "#D69F7E",
            "description": "I developed the landing website for The Protocol NFT, a project leveraging the Ethereum blockchain to enhance direct interactions between NFT holders and their evolving roadmap. Click on the image for a closer look at the site."
          },
          {
            "href": "https://github.com/mene4485/Snake/tree/main",
            "title": "Snake Game in Assembly",
            "imgName": "snake.webp",
            "color": "#D69F7E",            "description": "I worked on adapting the classic Snake game to run on the Gecko4Education EPFL-Edition board, using assembly language. This project allowed me to explore the basics of low-level programming and how it interacts with hardware."
          },
          {
            "href": "https://github.com/mene4485/Super-Pac-Man",
            "title": "SuperPac Man (Java)",
            "imgName": "pacMan.png",
            "color": "#D69F7E",            "description": "In the context of a university project, I worked on developing a pac man implementation in Java."
          },
          
          {
            "href": "https://github.com/mene4485/semanticSegmentation/tree/main",
            "title": "Data Augmentation (for SS)",
            "imgName": "DA_SS.jpeg",
            "color": "#D69F7E",            "description": "For a university project, I contributed to the development of a data augmentation pipeline, focusing on its impact on the performance of semantic segmentation (SS) models."
          },

          {
            "href": "https://github.com/RasanYo/MissingMigrants",
            "title": "Hackhaton 2nd place Technical Excellence",
            "imgName": "MissingMigrants.jpeg",
            "color": "#D69F7E",            "description": "In around 30 hours, we developed a AI-driven tool designed to aid the International Organization for Migration (IOM) in rapidly gathering and summarizing multilingual news. The goal is to provide quick and accurate insights into global events involving migrants, tailored to the IOM's data verification needs. This helps IOM gather information more efficiently and effectively, enabling them to better count and assist migrants worldwide."
          }
]
